const wines = {
	"id1": {name: "Полнотелое красное",},
	"id2": { name: "Среднетелое красное" },
	"id3": { name: "Легкое красное" },
	"id4": { name: "Розовое" },
	"id5": { name: "Ароматное белое" },
	"id6": { name: "Полнотелое белое" },
	"id7": { name: "Легкотельное белое" },
	"id8": { name: "Игристое" },
	"id9": { name: "Десертное" }
};

const fullBodiedRed = ["Каберне Совиньон", "Мерло", "Каберне Фран", "Карменер", "Бордо", "Санджовезе", "Сира (Шираз)", "Мальбек", "Пти Сира", "Монастрель (Мурведр)"];