const wines = {
	"id1": {name: "Полнотелое красное",},
	"id2": { name: "Среднетелое красное" },
	"id3": { name: "Легкое красное" },
	"id4": { name: "Розовое" },
	"id5": { name: "Ароматное белое" },
	"id6": { name: "Полнотелое белое" },
	"id7": { name: "Легкотельное белое" },
	"id8": { name: "Игристое" },
	"id9": { name: "Десертное" }
};

const wines2 = [
	{id: 1, name: "Полнотелое красное"},
	{id: 2, name: "Среднетелое красное"},
	{id: 3, name: "Легкое красное"},
	{id: 4, name: "Розовое"},
	{id: 5, name: "Ароматное белое"},
	{id: 6, name: "Полнотелое белое"},
	{id: 7, name: "Легкотельное белое"},
	{id: 8, name: "Игристое"},
	{id: 9, name: "Десертное"},
];

const fullBodiedRed = ["Каберне Совиньон", "Мерло", "Каберне Фран", "Карменер", "Бордо", "Санджовезе", "Сира (Шираз)", "Мальбек", "Пти Сира", "Монастрель (Мурведр)", "Пинотаж"];

const middleBodiedRed = ["Зинфандель", "Гренаш (Гарнача)", "Темпранилло", "вина Долины реки Роны", "Кариньян"];

const lightBodiedRed = ["Пино Нуар", "Гамэ (Божоле)"];

const rose = ["Gazela Rose", "Lago rose", "Folia Rosato Negroamaro", "Бюрнье Розе", "Розе Солнечной Долины", "Cerasuolo Montepulciano d’Abruzzo", "Garrus Rose", "Petale de Rose"];

const aromaWhite = ["Совиньон Блан", "Рислинг", "Белый мускат", "Гевюрцтраминер"];

const fullBodiedWhite = ["Шардоне", "Семильон", "Вионьер"];

const lightBodiedWhite = [ "Верментино", "Вердехо", "Грюнер Вельтлинер", "Коломбар", "Пино Гри", "Альбариньо", "Соаве", "Мускаде",   "Торронтес", "Шенин Блан"];

const champagne = ["Моет", "Дюк де Пари", "Bollinger", "Брют", "Вдова Клико", "Дом Периньон", "Мастро Бинелли", "Шампанское мартини", "Мондоро", "Просекко", "Асти", "Ламбруско", "Боско", "Кристалл"];

const dessert = ["Сотерн", "Барсак", "Серонс", "Кяр де Шом", "Вуврэ", "Токай Асзу", "Бееренауслезе", "Трокенбееренауслезе", "Речьото ди Соаве", "Вин санто"];

const orange = ["Радикон", "Vodopivec", "Гравнер", "Domaine Gauby", "Domaine Bohn", "Domaine Laurent Bannwarth"];

const wineCategories = [
	{ id: 1, name: 'Полнотелое красное'},
	{ id: 2, name: 'Среднетелое красное'},
	{ id: 3, name: 'Легкое красное'},
	{ id: 4, name: 'Розовое'},
	{ id: 5, name: 'Ароматное белое'},
	{ id: 6, name: 'Полнотелое белое'},
	{ id: 7, name: 'Легкотельное белое'},
	{ id: 8, name: 'Игристое'},
	{ id: 9, name: 'Десертное'},
]

const wineSorts = [
	{ id: 1, name: 'Каберне Совиньон'},
	{ id: 2, name: 'Мерло'},
	{ id: 3, name: 'Каберне Фран'},
	{ id: 4, name: 'Карменер'},
	{ id: 5, name: 'Бордо'},
	{ id: 6, name: 'Санджовезе'},
	{ id: 7, name: 'Сира (Шираз)'},
	{ id: 8, name: 'Мальбек'},
	{ id: 9, name: 'Пти Сира'},
	{ id: 10, name: 'Монастрель (Мурведр)'},
	{ id: 11, name: 'Пинотаж'},
	{ id: 12, name: 'Зинфандель'},
	{ id: 13, name: 'Гренаш (Гарнача)'},
	{ id: 14, name: 'Темпранилло'},
	{ id: 15, name: 'вина Долины Роны'},
	{ id: 16, name: 'Кариньян'},
	{ id: 17, name: 'Пино Нуар'},
	{ id: 18, name: 'Гамэ (Божоле)'},
	{ id: 19, name: 'Gazela Rose'},
	{ id: 20, name: 'Lago rose'},
	{ id: 21, name: 'Folia Rosato Negroamaro'},
	{ id: 22, name: 'Бюрнье Розе'},
	{ id: 23, name: 'Розе Солнечной Долины'},
	{ id: 24, name: 'Cerasuolo Montepulciano d’Abruzzo'},
	{ id: 25, name: 'Garrus Rose'},
	{ id: 26, name: 'Petale de Rose'},
	{ id: 27, name: 'Совиньон Блан'},
	{ id: 28, name: 'Рислинг'},
	{ id: 29, name: 'Белый мускат'},
	{ id: 30, name: 'Гевюрцтраминер'},
	{ id: 31, name: 'Шардоне'},
	{ id: 32, name: 'Семильон'},
	{ id: 33, name: 'Вионьер'},
	{ id: 34, name: 'Моет'},
	{ id: 35, name: 'Дюк де Пари'},
	{ id: 36, name: 'Bollinger'},
	{ id: 37, name: 'Брют'},
	{ id: 38, name: 'Вдова Клико'},
	{ id: 39, name: 'Дом Периньон'},
	{ id: 40, name: 'Мастро Бинелли'},
	{ id: 41, name: 'Шампанское мартини'},
	{ id: 42, name: 'Мондоро'},
	{ id: 43, name: 'Просекко'},
	{ id: 44, name: 'Асти'},
	{ id: 45, name: 'Ламбруско'},
	{ id: 46, name: 'Боско'},
	{ id: 47, name: 'Кристалл'},
	{ id: 48, name: 'Сотерн'},
	{ id: 49, name: 'Барсак'},
	{ id: 50, name: 'Серонс'},
	{ id: 51, name: 'Кяр де Шом'},
	{ id: 52, name: 'Вуврэ'},
	{ id: 53, name: 'Токай Асзу'},
	{ id: 54, name: 'Бееренауслезе'},
	{ id: 55, name: 'Трокенбееренауслезе'},
	{ id: 56, name: 'Речьото ди Соаве'},
	{ id: 57, name: 'Вин санто'},
	{ id: 58, name: 'Радикон'},
	{ id: 59, name: 'Vodopivec'},
	{ id: 60, name: 'Гравнер'},
	{ id: 61, name: 'Domaine Gauby'},
	{ id: 62, name: 'Domaine Bohn'},
	{ id: 63, name: 'Domaine Laurent Bannwarth'},
]

const mappedWineCategoriesToSorts = {
	1: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11],
	2: [12, 13, 14, 15, 16],
	3: [17, 18],
	4: [19, 20, 21, 22, 23, 24, 25, 26],
	5: [27, 28, 29, 30],
	6: [31, 32, 33],
	7: [34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47],
	8: [48, 49, 50, 51, 52, 53, 54, 55, 56, 57],
	9: [58, 59, 60, 61, 62, 63],
}

const foodSorts = [
	{id: 1, name: 'Говядина, свинина, баранина, частично индейка причисляются к красному мясу, имеющему характерный окрас. Полезные свойства, витамины, макро- и микроэлементы, содержащиеся в красном мясе, помогают избежать множества заболеваний.'},
	{id: 2, name: 'Крупнокусковые изделия колбасного производства, изготовленные из определенных частей туш убойных животных, подвергнутые посолу и термической обработке. Они имеют высокую вкусовую и питательную ценность, продолжительный срок хранения.'},
	{id: 3, name: 'Курятина, индюшатина и другая птица (но только грудки и крылышки!), крольчатина, телятина и молодая говядина (от животных не старше двух лет), постная вырезка свинины.'},
	{id: 4, name: 'Устрицы, кальмары, молюски, речные раки, крабы, креветки. Данная категория обитает в морских и речных водоемах.'},
	{id: 5, name: 'Сельдь, скумбрия, сёмга, лосось, форель, минтай, карп, карп, сазан, толстолобик, белый амур, щука, сом и другие рыбные представители морской и речной фауны.'},
	{id: 6, name: 'К твёрдым сырам относят пармезан, пекорино, романо, гауду, чеддер, эмменталь, бофорт. Полутвёрдые сыры отличаются от твёрдых текстурой и сокращённым сроком приготовления. К этому виду относят, например, маасдам, тильзитер, российский, голландский, литовский сыр.'},
	{id: 7, name: 'В категорию мягких сыров обычно включают свежие сыры, а также сыры с промытой или плесневой корочкой. Фета и брынза, знаменитые итальянские маскарпоне, рикотта, моцарелла, кремчиз, кавказские сулугуни, свели-квели и четук — тоже мягкие сыры. '},
	{id: 8, name: 'Свежие молодые побеги растений, растущих в культивированном или свободном виде. Зелень, брокколи, листовая капуста, шпинат, огурцы, помидоры, болгарский перец.'},
	{id: 9, name: 'Специфические специи. В том числе такие специи: аджвайн (ажгон), листья карри, чёрный кардамон, чёрный тмин, сычуаньский перец и розовый перец.'},
	{id: 10, name: 'Завершающее блюдо стола, предназначенное для получения приятных вкусовых ощущений в конце обеда или ужина. Обычно состоит из сладких продуктов, но может включать и другие предметы.'},
]