const wines = {
	"id1": {name: "Полнотелое красное",},
	"id2": { name: "Среднетелое красное" },
	"id3": { name: "Легкое красное" },
	"id4": { name: "Розовое" },
	"id5": { name: "Ароматное белое" },
	"id6": { name: "Полнотелое белое" },
	"id7": { name: "Легкотельное белое" },
	"id8": { name: "Игристое" },
	"id9": { name: "Десертное" }
};

const fullBodiedRed = ["Каберне Совиньон", "Мерло", "Каберне Фран", "Карменер", "Бордо", "Санджовезе", "Сира (Шираз)", "Мальбек", "Пти Сира", "Монастрель (Мурведр)", "Пинотаж"];

const middleBodiedRed = ["Зинфандель", "Гренаш (Гарнача)", "Темпранилло", "вина Долины реки Роны", "Кариньян"];

const lightBodiedRed = ["Пино Нуар", "Гамэ (Божоле)"];

const rose = ["Gazela Rose", "Lago rose", "Folia Rosato Negroamaro", "Бюрнье Розе", "Розе Солнечной Долины", "Cerasuolo Montepulciano d’Abruzzo", "Garrus Rose", "Petale de Rose"];

const aromaWhite = ["Совиньон Блан", "Рислинг", "Белый мускат", "Гевюрцтраминер"];

const fullBodiedWhite = ["Шардоне", "Семильон", "Вионьер"];

const lightBodiedWhite = [ "Верментино", "Вердехо", "Грюнер Вельтлинер", "Коломбар", "Пино Гри", "Альбариньо", "Соаве", "Мускаде",   "Торронтес", "Шенин Блан"];

const champagne = ["Моет", "Дюк де Пари", "Bollinger", "Брют", "Вдова Клико", "Дом Периньон", "Мастро Бинелли", "Шампанское мартини", "Мондоро", "Просекко", "Асти", "Ламбруско", "Боско", "Кристалл"];

const dessert = ["Сотерн", "Барсак", "Серонс", "Кяр де Шом", "Вуврэ", "Токай Асзу", "Бееренауслезе", "Трокенбееренауслезе", "Речьото ди Соаве", "Вин санто"];

const orange = ["Радикон", "Vodopivec", "Гравнер", "Domaine Gauby", "Domaine Bohn", "Domaine Laurent Bannwarth"];

const wineCategories = [
	{ id: 1, name: 'Полнотелое красное'},
	{ id: 2, name: 'Легкое красное'},
]

const wineSorts = [
	{ id: 1, name: 'Каберне Совиньон'},
	{ id: 2, name: 'Мерло'},
]

const mappedWineCategoriesToSorts = {
	1: [1, 2],
	2: [1]
}

